In [2]:

%%!
pip install --trusted-host pypi.org ipython-sql

['Collecting ipython-sql',
 '  Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)',
 'Collecting prettytable',
 '  Downloading prettytable-3.8.0-py3-none-any.whl (27 kB)',
 'Requirement already satisfied: six in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython-sql) (1.16.0)',
 'Collecting sqlalchemy>=2.0',
 '  Downloading SQLAlchemy-2.0.18-cp310-cp310-win_amd64.whl (2.0 MB)',
 '     ---------------------------------------- 0.0/2.0 MB ? eta -:--:--',
 '     - -------------------------------------- 0.1/2.0 MB 1.1 MB/s eta 0:00:02',
 '     - -------------------------------------- 0.1/2.0 MB 1.1 MB/s eta 0:00:02',
 '     --- ------------------------------------ 0.2/2.0 MB 1.0 MB/s eta 0:00:02',
 '     ---- ----------------------------------- 0.2/2.0 MB 1.2 MB/s eta 0:00:02',
 '     ------- -------------------------------- 0.4/2.0 MB 1.6 MB/s eta 0:00:01',
 '     -------- ------------------------------- 0.4/2.0 MB 1.7 MB/s eta 0:00:01',
 '     -------- ------------------------------- 0.4/2.0 MB 1.7 MB/s eta 0:00:01',
 '     --------- ------------------------------ 0.5/2.0 MB 1.3 MB/s eta 0:00:02',
 '     --------------- ------------------------ 0.8/2.0 MB 1.8 MB/s eta 0:00:01',
 '     --------------------- ------------------ 1.1/2.0 MB 2.4 MB/s eta 0:00:01',
 '     -------------------------- ------------- 1.3/2.0 MB 2.6 MB/s eta 0:00:01',
 '     -------------------------- ------------- 1.3/2.0 MB 2.6 MB/s eta 0:00:01',
 '     -------------------------- ------------- 1.3/2.0 MB 2.3 MB/s eta 0:00:01',
 '     ----------------------------- ---------- 1.5/2.0 MB 2.3 MB/s eta 0:00:01',
 '     ------------------------------- -------- 1.6/2.0 MB 2.3 MB/s eta 0:00:01',
 '     --------------------------------- ------ 1.6/2.0 MB 2.2 MB/s eta 0:00:01',
 '     ----------------------------------- ---- 1.8/2.0 MB 2.3 MB/s eta 0:00:01',
 '     ----------------------------------- ---- 1.8/2.0 MB 2.3 MB/s eta 0:00:01',
 '     ------------------------------------ --- 1.8/2.0 MB 2.1 MB/s eta 0:00:01',
 '     ---------------------------------------  2.0/2.0 MB 2.1 MB/s eta 0:00:01',
 '     ---------------------------------------- 2.0/2.0 MB 2.0 MB/s eta 0:00:00',
 'Collecting sqlparse',
 '  Downloading sqlparse-0.4.4-py3-none-any.whl (41 kB)',
 '     ---------------------------------------- 0.0/41.2 kB ? eta -:--:--',
 '     ---------------------------------------- 41.2/41.2 kB 1.9 MB/s eta 0:00:00',
 'Collecting ipython-genutils',
 '  Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)',
 'Requirement already satisfied: ipython in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython-sql) (8.8.0)',
 'Collecting greenlet!=0.4.17',
 '  Downloading greenlet-2.0.2-cp310-cp310-win_amd64.whl (192 kB)',
 '     ---------------------------------------- 0.0/192.2 kB ? eta -:--:--',
 '     ---------------------------- --------- 143.4/192.2 kB 2.8 MB/s eta 0:00:01',
 '     ------------------------------------ - 184.3/192.2 kB 2.2 MB/s eta 0:00:01',
 '     -------------------------------------- 192.2/192.2 kB 1.7 MB/s eta 0:00:00',
 'Collecting typing-extensions>=4.2.0',
 '  Downloading typing_extensions-4.7.1-py3-none-any.whl (33 kB)',
 'Requirement already satisfied: colorama in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (0.4.6)',
 'Requirement already satisfied: pickleshare in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (0.7.5)',
 'Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.11 in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (3.0.36)',
 'Requirement already satisfied: stack-data in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (0.6.2)',
 'Requirement already satisfied: jedi>=0.16 in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (0.18.2)',
 'Requirement already satisfied: decorator in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (5.1.1)',
 'Requirement already satisfied: traitlets>=5 in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (5.8.1)',
 'Requirement already satisfied: backcall in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (0.2.0)',
 'Requirement already satisfied: matplotlib-inline in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (0.1.6)',
 'Requirement already satisfied: pygments>=2.4.0 in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from ipython->ipython-sql) (2.14.0)',
 'Requirement already satisfied: wcwidth in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from prettytable->ipython-sql) (0.2.6)',
 'Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)',
 'Requirement already satisfied: executing>=1.2.0 in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from stack-data->ipython->ipython-sql) (1.2.0)',
 'Requirement already satisfied: asttokens>=2.1.0 in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from stack-data->ipython->ipython-sql) (2.2.1)',
 'Requirement already satisfied: pure-eval in c:\\users\\md\\appdata\\local\\packages\\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\\localcache\\local-packages\\python310\\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)',
 'Installing collected packages: ipython-genutils, typing-extensions, sqlparse, prettytable, greenlet, sqlalchemy, ipython-sql',
 'Successfully installed greenlet-2.0.2 ipython-genutils-0.2.0 ipython-sql-0.5.0 prettytable-3.8.0 sqlalchemy-2.0.18 sqlparse-0.4.4 typing-extensions-4.7.1',
 '',
 '[notice] A new release of pip is available: 23.0.1 -> 23.1.2',
 '[notice] To update, run: C:\\Users\\MD\\AppData\\Local\\Microsoft\\WindowsApps\\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\\python.exe -m pip install --upgrade pip']

In [3]:
%load_ext sql

In [4]:


%sql sqlite://

In [15]:
%%sql

CREATE TABLE Employees3 (
  id INT PRIMARY KEY,
  name VARCHAR(50),
  email VARCHAR(100)
);

 * sqlite://
Done.
(sqlite3.OperationalError) incomplete input
[SQL: INSERT INTO Employees3 (id, name, email) VALUES
(1, 'Rajesh Kumar', 'rajesh.kumar@example.com'),
(2, 'Sneha Sharma', 'sneha.sharma@example.com'),
(3, 'Amit Patel', 'amit.patel@example.com'),
(4, 'Pooja Gupta', 'pooja.gupta@example.com'),
(5, 'Rahul Verma', 'rahul.verma@example.com'),]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [18]:
%%sql
INSERT INTO Employees3 (id, name, email) VALUES
(1, 'Rajesh Kumar', 'rajesh.kumar@example.com'),
(2, 'Sneha Sharma', 'sneha.sharma@example.com'),
(3, 'Amit Patel', 'amit.patel@example.com'),
(4, 'Pooja Gupta', 'pooja.gupta@example.com'),
(5, 'Rahul Verma', 'rahul.verma@example.com')
;

 * sqlite://
5 rows affected.

[]

In [19]:
%%sql
SELECT * FROM employees3

 * sqlite://
Done.

[(1, 'Rajesh Kumar', 'rajesh.kumar@example.com'),
 (2, 'Sneha Sharma', 'sneha.sharma@example.com'),
 (3, 'Amit Patel', 'amit.patel@example.com'),
 (4, 'Pooja Gupta', 'pooja.gupta@example.com'),
 (5, 'Rahul Verma', 'rahul.verma@example.com')]

In [20]:
%%sql
select name , email from employees3;

 * sqlite://
Done.

[('Rajesh Kumar', 'rajesh.kumar@example.com'),
 ('Sneha Sharma', 'sneha.sharma@example.com'),
 ('Amit Patel', 'amit.patel@example.com'),
 ('Pooja Gupta', 'pooja.gupta@example.com'),
 ('Rahul Verma', 'rahul.verma@example.com')]

In [21]:
%%sql

CREATE TABLE Customers (
  id INT PRIMARY KEY,
  name VARCHAR(50),
  city VARCHAR(50),
  email VARCHAR(100)
);


INSERT INTO Customers (id, name, city, email) VALUES
(1, 'John Doe', 'New York', 'john.doe@example.com'),
(2, 'Jane Smith', 'Los Angeles', 'jane.smith@example.com'),
(3, 'Robert Johnson', 'New York', 'robert.johnson@example.com'),
(4, 'Emily Davis', 'Chicago', 'emily.davis@example.com'),
(5, 'Michael Wilson', 'New York', 'michael.wilson@example.com');


SELECT * FROM Customers WHERE city = 'New York';

 * sqlite://
Done.
5 rows affected.
Done.

[(1, 'John Doe', 'New York', 'john.doe@example.com'),
 (3, 'Robert Johnson', 'New York', 'robert.johnson@example.com'),
 (5, 'Michael Wilson', 'New York', 'michael.wilson@example.com')]

In [22]:
%%sql
CREATE TABLE Users (
  id INT PRIMARY KEY,
  name VARCHAR(50),
  date_of_birth DATE
);


INSERT INTO Users (id, name, date_of_birth) VALUES
(1, 'John Doe', '1990-05-15'),
(2, 'Jane Smith', '1985-09-10'),
(3, 'Robert Johnson', '1978-12-25'),
(4, 'Emily Davis', '1993-07-03'),
(5, 'Michael Wilson', '1982-11-18');


SELECT * FROM Users ORDER BY date_of_birth DESC;

 * sqlite://
Done.
5 rows affected.
Done.

[(4, 'Emily Davis', '1993-07-03'),
 (1, 'John Doe', '1990-05-15'),
 (2, 'Jane Smith', '1985-09-10'),
 (5, 'Michael Wilson', '1982-11-18'),
 (3, 'Robert Johnson', '1978-12-25')]

In [23]:
%%sql
CREATE TABLE Users_1 (
  id INT PRIMARY KEY,
  name VARCHAR(50),
  registration_date DATE
);


INSERT INTO Users_1 (id, name, registration_date) VALUES
(1, 'John Doe', '2022-01-15'),
(2, 'Jane Smith', '2021-12-10'),
(3, 'Robert Johnson', '2022-03-25'),
(4, 'Emily Davis', '2021-11-03'),
(5, 'Michael Wilson', '2022-02-18');


SELECT * FROM Users_1 ORDER BY registration_date ASC;

 * sqlite://
Done.
5 rows affected.
Done.

[(4, 'Emily Davis', '2021-11-03'),
 (2, 'Jane Smith', '2021-12-10'),
 (1, 'John Doe', '2022-01-15'),
 (5, 'Michael Wilson', '2022-02-18'),
 (3, 'Robert Johnson', '2022-03-25')]

In [24]:
%%sql
CREATE TABLE Employees_sal (
  id INT PRIMARY KEY,
  name VARCHAR(50),
  position VARCHAR(50),
  salary DECIMAL(10,2)
);


INSERT INTO Employees_sal (id, name, position, salary) VALUES
(1, 'John Doe', 'Manager', 5000.00),
(2, 'Jane Smith', 'Engineer', 4000.00),
(3, 'Robert Johnson', 'Analyst', 4500.00),
(4, 'Emily Davis', 'Developer', 5500.00),
(5, 'Michael Wilson', 'Designer', 4200.00);



SELECT name, position, salary
FROM Employees_sal
WHERE salary = (SELECT MAX(salary) FROM Employees_sal);

 * sqlite://
Done.
5 rows affected.
Done.

[('Emily Davis', 'Developer', 5500)]

In [25]:
%%sql
CREATE TABLE Customers_phone (
  id INT PRIMARY KEY,
  name VARCHAR(50),
  phone VARCHAR(15),
  email VARCHAR(100)
);

INSERT INTO Customers_phone (id, name, phone, email) VALUES
(1, 'John Doe', '+1-123-456-7890', 'john.doe@example.com'),
(2, 'Jane Smith', '+1-234-567-8901', 'jane.smith@example.com'),
(3, 'Robert Johnson', '+1-345-678-9012', 'robert.johnson@example.com'),
(4, 'Emily Davis', '+1-456-789-0123', 'emily.davis@example.com'),
(5, 'Michael Wilson', '+1-567-890-1234', 'michael.wilson@example.com');



SELECT * FROM Customers_phone WHERE phone LIKE '+1-567-890-1234';

 * sqlite://
Done.
5 rows affected.
Done.

[(5, 'Michael Wilson', '+1-567-890-1234', 'michael.wilson@example.com')]

In [26]:
%%sql
CREATE TABLE Orders (
  id INT PRIMARY KEY,
  customer_name VARCHAR(50),
  purchase_amount DECIMAL(10, 2)
);


INSERT INTO Orders (id, customer_name, purchase_amount) VALUES
(1, 'John Doe', 100.50),
(2, 'Jane Smith', 75.20),
(3, 'Robert Johnson', 200.80),
(4, 'Emily Davis', 150.40),
(5, 'Michael Wilson', 350.60),
(6, 'Sarah Thompson', 250.10),
(7, 'David Brown', 180.90),
(8, 'Jessica Lee', 210.75),
(9, 'Daniel Taylor', 450.30),
(10, 'Olivia Clark', 300.25);


SELECT customer_name, SUM(purchase_amount) AS total_purchase_amount
FROM Orders
GROUP BY customer_name
ORDER BY total_purchase_amount DESC
LIMIT 5;

 * sqlite://
Done.
10 rows affected.
Done.

[('Daniel Taylor', 450.3),
 ('Michael Wilson', 350.6),
 ('Olivia Clark', 300.25),
 ('Sarah Thompson', 250.1),
 ('Jessica Lee', 210.75)]

In [27]:
%%sql
CREATE TABLE Sales (
  id INT PRIMARY KEY,
  product_name VARCHAR(50),
  category VARCHAR(50),
  sales_amount DECIMAL(10, 2)
);


INSERT INTO Sales (id, product_name, category, sales_amount) VALUES
(1, 'Product A', 'Category 1', 100.00),
(2, 'Product B', 'Category 1', 150.00),
(3, 'Product C', 'Category 2', 200.00),
(4, 'Product D', 'Category 2', 75.00),
(5, 'Product E', 'Category 3', 300.00);


SELECT category, SUM(sales_amount) AS total_sales,
       (SUM(sales_amount) / (SELECT SUM(sales_amount) FROM Sales)) * 100 AS sales_percentage
FROM Sales
GROUP BY category;

 * sqlite://
Done.
5 rows affected.
Done.

[('Category 1', 250, 0), ('Category 2', 275, 0), ('Category 3', 300, 0)]

In [28]:
%%sql
CREATE TABLE Orders1 (
  id INT PRIMARY KEY,
  customer_id INT,
  purchase_year INT,
  purchase_amount DECIMAL(10, 2)
);


INSERT INTO Orders1 (id, customer_id, purchase_year, purchase_amount) VALUES
(1, 1, 2019, 100.00),
(2, 1, 2020, 150.00),
(3, 2, 2019, 200.00),
(4, 2, 2020, 50.00),
(5, 3, 2019, 300.00),
(6, 3, 2020, 200.00);



SELECT 
  c.name, 
  c.email, 
  SUM(o.purchase_amount) AS total_purchase_amount
FROM 
  Customers c
JOIN 
  Orders1 o ON c.id = o.customer_id
GROUP BY 
  c.id, c.name, c.email
HAVING 
  SUM(o.purchase_amount) = (
    SELECT 
      MAX(total_purchases)
    FROM 
      (SELECT 
        customer_id, SUM(purchase_amount) AS total_purchases
      FROM 
        Orders1
      GROUP BY 
        customer_id) AS subquery
  );

 * sqlite://
Done.
6 rows affected.
Done.

[('Robert Johnson', 'robert.johnson@example.com', 500)]